with y1 as 
(
  select distinct substr(paid_time,1,19) paid_time,ab_name,good_type,u_user 
  from tmp.lidanping_quanyu_198test_2_goodtype
  where channel = 'C端'
  and good_type = '线索品198' -- in ('3个月同步课198','线索品198','12个月同步课498')
  and substr(paid_time,1,10) between '2025-11-01' and '2025-12-31'
  -- and u_user = '65ebec5dd65732000194f8e6'
) --同一天一个商品多次购买算一次

,y2 as 
(
  select paid_time,ab_name,good_type,u_user,phone,grade,clue_source,created_at,clue_expire_time
  ,case when created_at is null then '未触达'
        when created_at <= paid_time then '已在库'
        when clue_source = 'WeCom' then '企微触达'
        else '其他触达' end contact_way
  ,case when created_at is null then ''
        when created_at <= paid_time then paid_time
        else created_at end calculate_time
  from 
  (
    select 
    y1.paid_time
    ,y1.ab_name
    ,y1.good_type
    ,y1.u_user
    ,a.phone
    ,a.grade
    ,y2.clue_source
    ,substr(y2.created_at,1,19) created_at
    ,substr(y2.clue_expire_time,1,19) clue_expire_time
    ,row_number() over (partition by y1.u_user,y1.good_type,substr(y1.paid_time,1,10) order by y2.created_at) as aa --多次触达取购买后首次触达
    from y1
    left join
    (
        select info_uuid,user_id,created_at,clue_expire_time,clue_source
        from aws.clue_info
        where substr(clue_expire_time,1,10)>='2025-09-01'
    ) y2 --电销触达信息
    on u_user = user_id and substr(clue_expire_time,1,19) > paid_time --and trunc(substr(y1.paid_time,1,10),'MM') >= trunc(substr(created_at,1,10),'MM') --触达只算本月触达
    left join 
    (
      select  
      u_user,if(phone is null,phone,if(phone rlike "^\\d+$",phone,cast(unbase64(phone) as string))) AS phone,grade
      from dw.dim_user
      where length(phone)>0
    ) a 
    on y1.u_user = a.u_user
  )
  where aa = 1
)

,y3 as --转化订单表
(
  select 
  substr(pay_time,1,19) pay_time 
  ,substr(pay_time,1,7) pay_ym 
  ,worker_id
  ,worker_name
  ,order_id
  ,business_good_kind_name_level_1
  ,business_good_kind_name_level_2 
  ,user_id
  ,amount
  ,good_name
  from aws.crm_order_info a
  where
  substr(pay_time,1,10)  between '2025-09-01' and date_sub(current_date,1)
  and worker_id <> 0
  and in_salary = 1
  and is_test = false
  and status = '支付成功'
)


--未触达明细
-- select paid_time,ab_name,good_type,u_user,phone,grade
-- from y2
-- where contact_way = '未触达'

--------------
--人工录入之后转化情况

select
paid_time
,phone
,grade
,pay_time
,worker_name
,good_name
,amount
from 
(
  select paid_time,ab_name,good_type,u_user,phone,grade
  from y2
  where phone in ('19853858006','13608575384','19501903833','17262714315','15222650772','17551540532','15918682298','13908168757','18650308802',
  '18276780062','13081579863','18012891609','18352161601','13877869734','17531992673','13677977301','13981195550','13807602863','13653032547','15854435299',
  '18666608213','15083029320','13547867108','13576903625','15848741200','13990257230','13603767900','13051583868','15847274142','13117505007','19050285818','19916431816','18040791626','19520620583','13824748905','17859442375',
  '18950879856','13642735744','13821833782','19810606390','17736626749','13509056110','15166028827','18097503879','13715237546','18275639807','19899192087','13878596216','18947457292','18076247986','15667690368','13312600501','18811982893',
  '15120859502','18922601212','18365176675','18964903707','18672555026','13284858222','13488589299','13916039952','13558097217','18397195069','18643335658','17839431542','15240532615','18124781334','18024173956','13637325750','15096694451',
  '13779954368','13980181802','18782044558','19240133563','19382952035','18033645184','17797976027','18166992856','18606309563','13210060656','13606032666','13602621091','13950301866','13172640606','19553995835','18246611437','15103447013','13833665892','14754909656','13864436597','13459254260','18212101715','13835556696','19283998597',
  '17859399756','15876652443','18795058046','18396008662','13877850013','18760625027','13297909255','13969469956','17671803650','13907583765','13380171233','18732256688','16670311002','18925381897','18895569520','13859762854','18857522211','15760640619','18711574853','18855493895','17600875501',
  '18055349987','19586505257','15589118215','13500784999','15772174606','18956477307','18318071589','19735492825','15876628046','18265948152','13260110065','17762852037','19819252868','16692257291','13965761636','13105055335','18608229908','13478692377','13883218016','18229255463','18885650377',
  '18873652025','13670262826','18102870631','18719275746','13899081015','18280275356','13570274556','15991683865','18269853188','19100653668','18767633998','18518262670','13303676701','13952747000','19993127673','13426401977','17780578661','18935105863','13760574220','18842361206','13679871427','15079643525','13656688118',
  '13061790610','13048737554','13302351751','15842869788','15199429230','13860498237','13830038283','13886237536','18085018556','18165155587','19568240998','18651993588','18865465750','13753294890','15211282006','15063434000','18383186517','15036874260','18240402209','19803439087','13601914575','15286317827',
  '17612714309','13608529507','15992027360','17615595566','17725291473','19375939529','13508750992','14743805000','15929001060','18940765339','18376895171','15524118850','15172891620','13055722938','13433320185','17782856827','15570757335','18888286165','17816228275','15642622869','13550680255','15598549018','13599105220','15753661636')
) a 
left join 
y3 on u_user = user_id and pay_time > paid_time